###############################################################################
#                                                                             #
#                           Как работает Python                               #
#                                                                             #
###############################################################################

"""
Python - интерпретируемый язык программирования со строгой динамической
типизацией.

Что значит интерпретируемый?
Для выполнения программ в Python используется интерпретатор - специальная
программа, которая считывает код, написанный программистом построчно и, в
случае если нет ошибок, выполняет его. Это краткое описание механизмы работы
Python. Сейчас расскажу подробнее, если интересно, читай дальше.


"""
